# 台灣國中必會英文單字池
# 每行一個單字（小寫），# 開頭為註解
# 此檔為選字腳本的候選來源，搭配 vocab-history.json 做去重
# 持續擴充中，目標 1000 字

# --- 基礎名詞 ---
apple
bag
ball
bank
basket
bath
beach
bed
bell
bird
birthday
boat
body
book
bottle
box
bread
breakfast
bridge
brother
bus
butter
cake
camera
camp
candy
cap
card
carpet
cat
chair
chance
cheese
chicken
child
chocolate
church
circle
city
class
clock
coat
coffee
color
computer
cook
corner
country
cow
cup
culture
dance
date
daughter
desk
diary
dinner
doctor
dog
dollar
door
dream
dress
drink
drum
duck
ear
egg
end
enemy
energy
engine
evening
event
eye
face
fact
family
fan
farm
father
feel
field
finger
fire
fish
flag
floor
flower
food
foot
fork
friend
fruit
fun
future
game
garden
gas
gate
gift
girl
glass
glove
goal
grade
grass
group
guitar
hair
hand
head
heart
hill
hole
home
horse
hospital
hotel
hour
house
ice
idea
island
jacket
job
joke
joy
juice
key
kid
king
kiss
knee
knife
lake
lamp
land
leaf
leg
lesson
letter
level
library
life
light
line
lion
list
love
luck
lunch
mail
map
market
mask
meal
meat
member
milk
mind
minute
money
monkey
month
moon
morning
mother
mountain
mouse
mouth
movie
music
name
nature
neck
news
night
nose
note
number
nurse
ocean
oil
onion
orange
page
paint
pair
palace
paper
park
part
party
path
peace
pen
pencil
people
pet
phone
photo
piano
picture
pie
piece
pig
pizza
place
plan
plant
plate
player
point
police
pool
post
power
price
prince
princess
prize
problem
program
queen
question
rabbit
rain
reason
rest
rice
ring
river
road
rock
role
roof
room
rose
rule
salt
sand
school
science
season
seat
secret
shape
sheep
shirt
shoe
shop
shoulder
side
sign
silver
sister
size
skill
skin
sky
sleep
smile
snow
soap
sock
son
song
soup
space
spider
spoon
spring
square
stage
star
station
step
stone
store
storm
story
street
student
sugar
summer
sun
table
tail
tea
team
teeth
test
thing
ticket
tiger
time
title
toe
tooth
top
tower
town
toy
train
tree
trip
truck
turn
umbrella
uncle
uniform
vacation
valley
vegetable
video
village
voice
wall
watch
water
wave
way
weather
week
weekend
whale
wheel
wife
wind
window
wing
winter
woman
wood
word
world
year
zero
zoo

# --- 基礎動詞 ---
accept
add
agree
allow
answer
appear
ask
become
begin
believe
belong
blow
break
bring
build
burn
buy
call
carry
catch
change
chase
check
choose
clean
climb
close
collect
come
compare
continue
control
cook
copy
cost
count
cover
create
cry
cut
decide
describe
design
die
dig
divide
do
draw
drive
drop
dry
eat
enjoy
enter
escape
example
excuse
expect
explain
express
fail
fall
feed
feel
fight
fill
find
finish
fit
fix
fly
follow
forget
freeze
get
give
go
grow
guess
happen
hate
have
hear
help
hide
hit
hold
hope
hurt
imagine
include
interest
join
jump
keep
kick
kill
kiss
know
land
laugh
lay
lead
learn
leave
lend
let
lie
like
listen
live
look
lose
love
make
mark
matter
mean
meet
miss
mix
move
need
notice
offer
open
order
own
pass
pay
pick
plan
play
point
pour
prefer
pull
push
put
raise
reach
read
receive
record
remember
repeat
reply
rest
ride
ring
rise
roll
run
rush
save
say
search
see
sell
send
serve
set
share
shine
shoot
show
shut
sing
sit
sleep
smell
smile
speak
spend
stand
start
stay
stop
study
swim
take
talk
taste
teach
tell
think
throw
touch
travel
try
turn
understand
use
visit
wait
wake
walk
want
wash
watch
wear
welcome
win
wish
wonder
work
worry
write

# --- 基礎形容詞 ---
able
afraid
alone
angry
bad
beautiful
big
black
blue
boring
bright
brown
busy
cheap
clean
clear
close
cold
comfortable
common
cool
correct
crazy
dark
dead
dear
deep
delicious
different
difficult
dirty
dry
easy
empty
enough
every
expensive
fair
famous
fast
fat
favorite
fine
flat
foreign
free
fresh
full
glad
good
gray
great
green
happy
hard
healthy
heavy
high
honest
hot
huge
ill
interesting
kind
large
late
lazy
little
long
loud
low
lucky
main
mean
modern
narrow
natural
near
necessary
new
nice
normal
old
open
orange
own
perfect
pink
plain
pleasant
polite
poor
popular
possible
pretty
proud
public
purple
quick
quiet
real
red
rich
right
round
rude
sad
safe
same
scared
serious
sharp
short
shy
sick
silly
simple
slow
small
smart
soft
sorry
special
strange
strict
strong
successful
sure
surprised
sweet
tall
terrible
thick
thin
thirsty
tiny
tired
total
traditional
true
ugly
unhappy
useful
warm
weak
wet
white
whole
wide
wild
wonderful
worried
wrong
yellow
young

# --- 補充常用單字 ---
airport
apartment
bakery
balcony
blanket
bookstore
boyfriend
candle
cartoon
cellphone
center
classmate
closet
cockroach
contest
conversation
corner
costume
couch
courage
cousin
crayon
curtain
customer
dentist
department
dessert
dictionary
dinosaur
direction
dolphin
doughnut
dragon
drawer
earring
earthquake
electricity
elementary
elevator
envelope
eraser
exercise
factory
flashlight
foreigner
garbage
giant
girlfriend
government
grocery
habit
hamburger
handsome
headache
helicopter
hippo
homework
honeymoon
housework
typhoon
uniform
vacation
vampire
volleyball
waterfall
weekend
wizard

# --- 基礎副詞 ---
about
above
across
after
again
ago
ahead
almost
along
already
also
always
away
back
before
behind
below
besides
carefully
certainly
clearly
correctly
deeply
easily
enough
especially
even
ever
everywhere
exactly
finally
first
forever
forward
free
gently
greatly
happily
hard
here
honestly
however
immediately
inside
instead
just
lately
later
luckily
maybe
mostly
naturally
nearly
never
next
no
normally
not
now
often
once
only
out
outside
perhaps
possibly
probably
quickly
quietly
quite
really
recently
sadly
seldom
seriously
simply
slowly
so
softly
sometimes
somewhere
soon
still
suddenly
surely
then
there
though
today
together
tomorrow
tonight
too
truly
twice
under
unfortunately
until
up
usually
very
well
yet

# --- 常用連接詞/介系詞（僅收教學有意義的） ---
although
because
between
during
either
toward
unless
whether
without
